In [2]:
import numpy as np
import pandas as pd

In [3]:
weather = pd.read_csv('./Pandas_data_file/seoul_weather.csv',encoding='cp949',skiprows=11)

weather.head(2)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN

In [12]:
# 1.역대 최고기온인 날의 날짜는?
# 2.일교차가 가장 큰 월은 언제인가?
# 3.월교차(월간 온도 분산)가 가장 큰 월은?

In [13]:
# 1. 역대 최고기온인 날의 날짜는?

weather['평균기온(℃)'].max()

33.7

In [14]:
# 2.일교차가 가장 큰 월은 언제인가?

# 일교차 = 'temp_diff' 열 추가
weather['temp_diff'] = weather['최고기온(℃)']-weather['최저기온(℃)']


weather['temp_diff']

0        12.8
1        14.1
2         8.2
3        10.8
4        14.5
         ...
40483     4.6
40484     9.2
40485    12.7
40486     9.1
40487    13.1
Name: temp_diff, Length: 40488, dtype: float64

In [17]:
weather

,\t\t지점번호,지점명,일시,평균기온(℃),최고기온(℃),\t최고기온시각,최저기온(℃),최저기온시각,temp_diff
0,108,서울,1907-10-01,13.5,20.7,NaN,7.9,NaN,12.8
1,108,서울,1907-10-02,16.2,22.0,NaN,7.9,NaN,14.1
2,108,서울,1907-10-03,16.2,21.3,NaN,13.1,NaN,8.2
3,108,서울,1907-10-04,16.5,22.0,NaN,11.2,NaN,10.8
4,108,서울,1907-10-05,17.6,25.4,NaN,10.9,NaN,14.5
...,...,...,...,...,...,...,...,...,...
40483,108,서울,2019-10-07,14.8,17.9,00:01,13.3,23:09,4.6
40484,108,서울,2019-10-08,14.7,19.8,14:42,10.6,23:31,9.2
40485,108,서울,2019-10-09,13.6,20.4,14:41,7.7,07:04,12.7
40486,108,서울,2019-10-10,15.2,19.8,15:08,10.7,02:15,9.1
40487,108,서울,2019-10-11,18.8,26.1,15:48,13.0,06:59,13.1

In [15]:
# 일시 에서 '월' 정보 추출

weather['일시'].apply(lambda x: x.split("-")[1]).unique()  #1~10월 까지 존재

array(['10', '11', '12', '01', '02', '03', '04', '05', '06', '07', '08',
       '09'], dtype=object)

In [18]:
weather.groupby('일시')['temp_diff'].max()

일시
1907-10-01    12.8
1907-10-02    14.1
1907-10-03     8.2
1907-10-04    10.8
1907-10-05    14.5
              ...
2019-10-07     4.6
2019-10-08     9.2
2019-10-09    12.7
2019-10-10     9.1
2019-10-11    13.1
Name: temp_diff, Length: 40488, dtype: float64

In [21]:
# 월별로 묶어 일교차의 최대값을 어떻게 구하지??

weather['일시'].apply(lambda x: x.split("-")[1])

# 1,2,3,...10월 별로 데이터를 정리하고 싶음 

# column 추가?
weather['month'] = weather['일시'].apply(lambda x: x.split("-")[1])
weather.head()

,\t\t지점번호,지점명,일시,평균기온(℃),최고기온(℃),\t최고기온시각,최저기온(℃),최저기온시각,temp_diff,month
0,108,서울,1907-10-01,13.5,20.7,NaN,7.9,NaN,12.8,10
1,108,서울,1907-10-02,16.2,22.0,NaN,7.9,NaN,14.1,10
2,108,서울,1907-10-03,16.2,21.3,NaN,13.1,NaN,8.2,10
3,108,서울,1907-10-04,16.5,22.0,NaN,11.2,NaN,10.8,10
4,108,서울,1907-10-05,17.6,25.4,NaN,10.9,NaN,14.5,10

In [25]:
weather.groupby('month')['temp_diff'].max()   # 4월달 21.8

month
01    21.3
02    17.7
03    21.2
04    21.8
05    21.4
06    21.0
07    16.1
08    17.2
09    18.7
10    21.2
11    19.3
12    19.7
Name: temp_diff, dtype: float64

In [28]:
#월교차가 가장 큰 년도는? (월간 온도 분산)

# var() 함수 있음

# 0000년-00월의 평균온도  로 묶어야 월교차를 구할 수 있겠네 

weather['YM'] = weather['일시'].apply(lambda x: x.split('-')[:2])

weather['YM']

0    [1907, 10]
1    [1907, 10]
2    [1907, 10]
3    [1907, 10]
4    [1907, 10]
Name: YM, dtype: object

In [58]:
weather.isnull()

       \t\t지점번호    지점명     일시  평균기온(℃)  최고기온(℃)  \t최고기온시각  최저기온(℃)  최저기온시각
0         False  False  False    False    False      True    False    True
1         False  False  False    False    False      True    False    True
2         False  False  False    False    False      True    False    True
3         False  False  False    False    False      True    False    True
4         False  False  False    False    False      True    False    True
...         ...    ...    ...      ...      ...       ...      ...     ...
40483     False  False  False    False    False     False    False   False
40484     False  False  False    False    False     False    False   False
40485     False  False  False    False    False     False    False   False
40486     False  False  False    False    False     False    False   False
40487     False  False  False    False    False     False    False   False

[40488 rows x 8 columns]

In [62]:
## 강사님 코드 ##

In [63]:
import numpy as np
import pandas as pd

In [40]:
df = pd.read_csv('./Pandas_data_file/seoul_weather.csv',encoding='cp949',skiprows=11)

df.head(2)

   \t\t지점번호 지점명          일시  평균기온(℃)  최고기온(℃) \t최고기온시각  최저기온(℃) 최저기온시각
0       108  서울  1907-10-01     13.5     20.7      NaN      7.9    NaN
1       108  서울  1907-10-02     16.2     22.0      NaN      7.9    NaN

In [44]:
# df.drop(['\t\t지점번호', '지점명', '최저기온시각','\t최고기온시각'], axis=1, inplace=True)

In [43]:
df.head()

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.5     20.7      7.9
1  1907-10-02     16.2     22.0      7.9
2  1907-10-03     16.2     21.3     13.1
3  1907-10-04     16.5     22.0     11.2
4  1907-10-05     17.6     25.4     10.9

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40488 entries, 0 to 40487
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   일시       40488 non-null  object
 1   평균기온(℃)  39732 non-null  float64
 2   최고기온(℃)  39730 non-null  float64
 3   최저기온(℃)  39731 non-null  float64
dtypes: float64(3), object(1)
memory usage: 1.2+ MB

In [49]:
# 역대 최고기온인 날의 날짜는?

df.sort_values('최고기온(℃)', ascending=False).iloc[0]

일시         2018-08-01
평균기온(℃)          33.6
최고기온(℃)          39.6
최저기온(℃)          27.8
Name: 40051, dtype: object

In [51]:
# 일교차가 가장 큰 월은 언제인가?

df['일교차'] = df['최고기온(℃)']- df['최저기온(℃)']
df.head()

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)   일교차
0  1907-10-01     13.5     20.7      7.9  12.8
1  1907-10-02     16.2     22.0      7.9  14.1
2  1907-10-03     16.2     21.3     13.1   8.2
3  1907-10-04     16.5     22.0     11.2  10.8
4  1907-10-05     17.6     25.4     10.9  14.5

In [55]:
df['월'] = df['일시'].apply(lambda x:x.split('-')[1])

In [56]:
df.groupby('월')['일교차'].mean().sort_values(ascending = False)  # 일교차의 월평균이 가장 큰 달

월
10    10.909529
05    10.869518
04    10.830459
06     9.757156
03     9.568571
09     9.498056
11     9.408580
02     8.861858
01     8.431193
12     8.259219
08     7.987541
07     7.380793
Name: 일교차, dtype: float64

In [57]:
df.groupby('월')['일교차'].mean().sort_values(ascending = False).iloc[:1]

월
10    10.909529
Name: 일교차, dtype: float64

In [59]:
df.sort_values('일교차',ascending=False).iloc[:1]  # 가장 일교차가 큰 달

               일시  평균기온(℃)  최고기온(℃)  최저기온(℃)   일교차   월
12619  1942-04-19     12.7     24.3      2.5  21.8  04

In [ ]:
# 월교차(월간 온도 분산)이 가장 큰 년도?

In [61]:
df['년'] = df['일시'].apply(lambda x: x.split('-')[0])
df.groupby(["년",'월'])['평균기온(℃)'].mean().unstack().std(axis=1).sort_values(ascending=False).iloc[:1]

년
1917    12.088418
dtype: float64

In [52]:
df['일시'].apply(lambda x:x[:7])  # 이걸 인덱스로 이렇게..??

0        1907-10
1        1907-10
2        1907-10
3        1907-10
4        1907-10
          ...
40483    2019-10
40484    2019-10
40485    2019-10
40486    2019-10
40487    2019-10
Name: 일시, Length: 40488, dtype: object